src/cf/Documents/DogTracking.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>DogTracking</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.HealthStatuses</xr:Item>
				<xr:Item>InformationRegister.LouseDogTreatment</xr:Item>
				<xr:Item>InformationRegister.InformationDog</xr:Item>
				<xr:Item>InformationRegister.TrackingHistory</xr:Item>
				<xr:Item>InformationRegister.InjectionHistory</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DogOwner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DogOwners</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Dog</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Dogs</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Weight</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EndTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StartTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Purpose</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Purposes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Image</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Zone</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Zones</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>HealthStatus</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Disease</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CoreDiseases</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Veterinarian</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Veterinarians</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IsCured</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>InjectionHistory</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Vaccine</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Vaccines</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NextVaccination</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Disease</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CoreDiseases</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Veterinarian</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Veterinarians</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>LouseDogTreatment</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Product</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Products</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Veterinarian</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Veterinarians</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/DogTracking/Forms/DocumentForm/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	//Huong (Fill Weight and Age)
	DoB = new ValueTable;
	DoB.Columns.Add("DateOfBirth",new TypeDescription("date"));
	NewDoB = DoB.Add();
	NewDoB.DateOfBirth = Object.Dog.DateOfBirth;
	If not object.Ref.isempty() then
		FillAge(DoB);
	Endif;
	Object.Weight = Object.Dog.Weight;
	DoB.Clear();
	//End Huong
	//Items.Dog.ListChoiceMode = True;
	Items.DogOwner.ChoiceList.Add(Object.DogOwner);
	GetImageDog();
EndProcedure

&AtServer
Procedure FillAge(Val DoB)
	
	Var DogAge, Query, QueryResult, SelectionDetailRecords;
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	DoB.DateOfBirth AS DateOfBirth
	|INTO DoBvalue
	|FROM
	|	&DoB AS DoB
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	DATEDIFF(DoBvalue.DateOfBirth, &currentdate, MONTH) / 12 AS Age
	|FROM
	|	DoBvalue AS DoBvalue";
	
	Query.SetParameter("currentdate", currentdate());
	Query.SetParameter("DoB", DoB);
	
	
	QueryResult = Query.Execute();
	
	SelectionDetailRecords = QueryResult.Select();
	
	While SelectionDetailRecords.Next() Do
		DogAge = Object.Dog.GetObject();
		DogAge.Age = SelectionDetailRecords.age;
		DogAge.Write();
	EndDo;

EndProcedure


Function  FillChoiceList()
	
	ChoiceArr = new Array();
	For each owner in object.Dog.OwnerSecondary do
		ChoiceArr.Add(Owner.Owner);
	Enddo;
	Return ChoiceArr;

EndFunction

&AtServer
Procedure DogOnChangeAtServer()
	//Huong 
	DoB = new ValueTable;
	DoB.Columns.Add("DateOfBirth",new TypeDescription("date"));
	NewDoB = DoB.Add();
	NewDoB.DateOfBirth = Object.Dog.DateOfBirth;
	If not object.Ref.isempty() then
		sth = Object.Dog;
		FillAge(DoB);
		//Object.Weight = 0;
	Endif;
	DoB.Clear();
	Object.DogOwner = Object.Dog.Owner;
	Object.Weight = Object.Dog.Weight;
	Items.DogOwner.ChoiceList.Add(Object.Dog.Owner);
	//End Huong
EndProcedure

&AtClient
Procedure DogOnChange(Item)
	DogOnChangeAtServer();
	GetImageDog();
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	// Huong (Auto set StartDate to currentdate when left empty)
	If not valueisfilled(Object.StartTime) then
		CurrentObject.StartTime = CurrentDate();
	Endif;
	//End Huong
EndProcedure

&AtServer
Procedure OnOpenAtServer()
	// Insert handler content.
	sth = ThisForm;
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	OnOpenAtServer();
EndProcedure

&AtClient
Procedure DogOwnerStartChoice(Item, ChoiceData, StandardProcessing)
	//Huong (Fill list choice of owners depends on dog)
	ChoiceList = Items.DogOwner.ChoiceList;
	ChoiceList.Clear();
	ChoiceArr = FillChoiceList();
	For each item in ChoiceArr do
		ChoiceList.Add(item);
	Enddo;
	//End Huong
EndProcedure

&AtServer
Procedure GetImageDog()
Picture=PutToTempStorage(Object.Dog.Picture.Get());	
EndProcedure
